# adilet mamytov 
# Практика функций и методов строк

# 1. Напишите 4 функции для 4ых математических операций и приведите по 2 примера работы с каждой:
# - addition 
# - multiplication 
# - division 
# - subtraction 

# def calculator_1():
#     print('Hello user, this additon calculator!!!')
#     a = int(input('enter the value a: '))
#     b = int(input('enter the value b: '))
#     return a+b 
# result=calculator_1()
# print(result)

# def calculator_2(): 
#     print('Hello user, this subtraction calculator!!!')
#     c = int(input('enter the value c: '))
#     d = int(input('enter the value d: '))
#     return c - d
# result_2 = calculator_2()
# print(result_2)

# def calculator_3():
#     print('Hello user, this division calculator!!!')
#     e = float(input('enter the value e: '))
#     f = float(input('enter the value f: '))
#     return e / f
# result_3 = calculator_3()
# print(result_3)

# def calculator_4(): 
#     print('Hello user, this multiply calculator!!!')
#     g = int(input('enter the value g: '))
#     h = int(input('enter the value h: '))
#     return g * h
# result_4 = calculator_4()
# print(result_4)


# 2. Напишите функцию которая на вход будет получать слово и выводить в консоль 1ый и последний #символ из него. Приведите примеры работы с ней.

def test_word():
    print('Hello user,this is your 1st and last ltter')
    var1 = (input('enter the word: '))
    result = var1[1,-1]
    return test_word()
result = test_word()
print(result)



# 3. Создайте функцию для вывода в консоль всех букв из вашего имени, которые содержатся в вашей фамилии. Приведите примеры работы с ней.

# ВАШ КОД

# 4.Создайте функцию для вывода в консоль всех букв из вашего имени, которые НЕ содержатся в вашей фамилии. Приведите примеры работы с ней.

# ВАШ КОД